flask-webapp/tests/benchmarking/results_gunicron.txt
Benchmarking Shell Script for testing url shortner
Getting hardware info
- CPU
Architecture:                    x86_64
CPU op-mode(s):                  32-bit, 64-bit
Byte Order:                      Little Endian
Address sizes:                   39 bits physical, 48 bits virtual
CPU(s):                          8
On-line CPU(s) list:             0-7
Thread(s) per core:              2
Core(s) per socket:              4
Socket(s):                       1
NUMA node(s):                    1
- Memory
              total        used        free      shared  buff/cache   available
Mem:           15Gi       9.7Gi       631Mi       1.2Gi       5.0Gi       4.2Gi
Swap:         979Mi       377Mi       602Mi

[TEST 1]: Basic Benchmark, 100 get requests with 10 sent at a time of all urls
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        gunicorn
Server Hostname:        localhost
Server Port:            5000

Document Path:          /api/link
Document Length:        176704 bytes

Concurrency Level:      10
Time taken for tests:   2.495 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      17685300 bytes
HTML transferred:       17670400 bytes
Requests per second:    40.09 [#/sec] (mean)
Time per request:       249.466 [ms] (mean)
Time per request:       24.947 [ms] (mean, across all concurrent requests)
Transfer rate:          6923.11 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    57  234  39.8    237     286
Waiting:       57  234  39.9    237     286
Total:         57  234  39.8    237     286

Percentage of the requests served within a certain time (ms)
  50%    237
  66%    252
  75%    256
  80%    257
  90%    273
  95%    283
  98%    285
  99%    286
 100%    286 (longest request)

[TEST 2]: Test write.  Add the same link over and over again, currently the database doesn't care about duplicate links
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        gunicorn
Server Hostname:        localhost
Server Port:            5000

Document Path:          /api/link
Document Length:        90 bytes

Concurrency Level:      10
Time taken for tests:   0.160 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      23500 bytes
Total body sent:        17200
HTML transferred:       9000 bytes
Requests per second:    626.66 [#/sec] (mean)
Time per request:       15.958 [ms] (mean)
Time per request:       1.596 [ms] (mean, across all concurrent requests)
Transfer rate:          143.81 [Kbytes/sec] received
                        105.26 kb/s sent
                        249.07 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     2   15   5.0     13      27
Waiting:        2   15   5.0     13      27
Total:          2   15   5.0     13      27

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     14
  75%     15
  80%     20
  90%     24
  95%     25
  98%     26
  99%     27
 100%     27 (longest request)

[TEST 3]: Basic Benchmark, 100 get requests with 10 sent at a time, same all urls check for increased time
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        gunicorn
Server Hostname:        localhost
Server Port:            5000

Document Path:          /api/link
Document Length:        188404 bytes

Concurrency Level:      10
Time taken for tests:   2.625 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      18855300 bytes
HTML transferred:       18840400 bytes
Requests per second:    38.09 [#/sec] (mean)
Time per request:       262.510 [ms] (mean)
Time per request:       26.251 [ms] (mean, across all concurrent requests)
Transfer rate:          7014.35 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    37  248  46.5    255     310
Waiting:       36  248  46.5    255     309
Total:         37  248  46.5    255     310

Percentage of the requests served within a certain time (ms)
  50%    255
  66%    266
  75%    282
  80%    285
  90%    291
  95%    302
  98%    305
  99%    310
 100%    310 (longest request)

[TEST 4]: 100 get requests with 10 sent at a time, same url with same link
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        gunicorn
Server Hostname:        localhost
Server Port:            5000

Document Path:          /api/link/628fc798692aa3c29ff04456
Document Length:        119 bytes

Concurrency Level:      10
Time taken for tests:   0.182 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      26500 bytes
HTML transferred:       11900 bytes
Requests per second:    549.85 [#/sec] (mean)
Time per request:       18.187 [ms] (mean)
Time per request:       1.819 [ms] (mean, across all concurrent requests)
Transfer rate:          142.30 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     1   17   5.2     18      29
Waiting:        1   17   5.1     18      29
Total:          2   17   5.1     18      29

Percentage of the requests served within a certain time (ms)
  50%     18
  66%     19
  75%     19
  80%     20
  90%     25
  95%     28
  98%     29
  99%     29
 100%     29 (longest request)

[TEST 5]: Concurrency test with writes and reads at same time.

[PART 1]: Read Results
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        gunicorn
Server Hostname:        localhost
Server Port:            5000

Document Path:          /api/link/628fc798692aa3c29ff04456
Document Length:        119 bytes

Concurrency Level:      10
Time taken for tests:   0.287 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      26500 bytes
HTML transferred:       11900 bytes
Requests per second:    348.26 [#/sec] (mean)
Time per request:       28.714 [ms] (mean)
Time per request:       2.871 [ms] (mean, across all concurrent requests)
Transfer rate:          90.13 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     5   28   5.9     25      45
Waiting:        4   28   6.0     25      45
Total:          5   28   6.0     25      45

Percentage of the requests served within a certain time (ms)
  50%     25
  66%     27
  75%     29
  80%     29
  90%     39
  95%     41
  98%     43
  99%     45
 100%     45 (longest request)

[PART 2]: Write Results
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        gunicorn
Server Hostname:        localhost
Server Port:            5000

Document Path:          /api/link
Document Length:        90 bytes

Concurrency Level:      10
Time taken for tests:   0.277 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      23500 bytes
Total body sent:        17200
HTML transferred:       9000 bytes
Requests per second:    360.80 [#/sec] (mean)
Time per request:       27.716 [ms] (mean)
Time per request:       2.772 [ms] (mean, across all concurrent requests)
Transfer rate:          82.80 [Kbytes/sec] received
                        60.60 kb/s sent
                        143.40 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     3   27   7.9     26      47
Waiting:        3   26   7.9     26      47
Total:          3   27   7.9     26      47

Percentage of the requests served within a certain time (ms)
  50%     26
  66%     27
  75%     27
  80%     29
  90%     42
  95%     45
  98%     46
  99%     47
 100%     47 (longest request)